{
	"nodes":[
		{"op":"null","name":"Input","inputs":[]},
		{"op":"null","name":"conv1.Weights","inputs":[]},
		{"op":"null","name":"conv1.Biases","inputs":[]},
		{"op":"Convolution","name":"conv1","attrs":{"num_filter":"24","kernel":"(3, 3)","dilate":"(1, 1)","stride":"(1, 1)","num_group":"1","cudnn_off":"0","pad":"(0, 0)","no_bias":"False","layout":"None"},"inputs":[[0,0,0],[1,0,0],[2,0,0]]},
		{"op":"null","name":"bat1.Scaling","inputs":[]},
		{"op":"null","name":"bat1.Biases","inputs":[]},
		{"op":"null","name":"bat1.MovingMean","inputs":[]},
		{"op":"null","name":"bat1.MovingVariance","inputs":[]},
		{"op":"BatchNorm","name":"bat1","attrs":{"eps":"0.001","momentum":"0.9","fix_gamma":"false","use_global_stats":"false","axis":"1","cudnn_off":"0"},"inputs":[[3,0,0],[4,0,0],[5,0,0],[6,0,0],[7,0,0]]},
		{"op":"relu","name":"ramp1$0","inputs":[[8,0,0]]},
		{"op":"null","name":"conv2.Weights","inputs":[]},
		{"op":"null","name":"conv2.Biases","inputs":[]},
		{"op":"Convolution","name":"conv2","attrs":{"num_filter":"24","kernel":"(3, 3)","dilate":"(1, 1)","stride":"(1, 1)","num_group":"1","cudnn_off":"0","pad":"(0, 0)","no_bias":"False","layout":"None"},"inputs":[[9,0,0],[10,0,0],[11,0,0]]},
		{"op":"null","name":"bat2.Scaling","inputs":[]},
		{"op":"null","name":"bat2.Biases","inputs":[]},
		{"op":"null","name":"bat2.MovingMean","inputs":[]},
		{"op":"null","name":"bat2.MovingVariance","inputs":[]},
		{"op":"BatchNorm","name":"bat2","attrs":{"eps":"0.001","momentum":"0.9","fix_gamma":"false","use_global_stats":"false","axis":"1","cudnn_off":"0"},"inputs":[[12,0,0],[13,0,0],[14,0,0],[15,0,0],[16,0,0]]},
		{"op":"relu","name":"ramp2$0","inputs":[[17,0,0]]},
		{"op":"null","name":"conv3.Weights","inputs":[]},
		{"op":"null","name":"conv3.Biases","inputs":[]},
		{"op":"Convolution","name":"conv3","attrs":{"num_filter":"24","kernel":"(3, 3)","dilate":"(1, 1)","stride":"(1, 1)","num_group":"1","cudnn_off":"0","pad":"(0, 0)","no_bias":"False","layout":"None"},"inputs":[[18,0,0],[19,0,0],[20,0,0]]},
		{"op":"null","name":"bat3.Scaling","inputs":[]},
		{"op":"null","name":"bat3.Biases","inputs":[]},
		{"op":"null","name":"bat3.MovingMean","inputs":[]},
		{"op":"null","name":"bat3.MovingVariance","inputs":[]},
		{"op":"BatchNorm","name":"bat3","attrs":{"eps":"0.001","momentum":"0.9","fix_gamma":"false","use_global_stats":"false","axis":"1","cudnn_off":"0"},"inputs":[[21,0,0],[22,0,0],[23,0,0],[24,0,0],[25,0,0]]},
		{"op":"relu","name":"ramp3$0","inputs":[[26,0,0]]},
		{"op":"null","name":"conv4.Weights","inputs":[]},
		{"op":"null","name":"conv4.Biases","inputs":[]},
		{"op":"Convolution","name":"conv4","attrs":{"num_filter":"24","kernel":"(3, 3)","dilate":"(1, 1)","stride":"(1, 1)","num_group":"1","cudnn_off":"0","pad":"(0, 0)","no_bias":"False","layout":"None"},"inputs":[[27,0,0],[28,0,0],[29,0,0]]},
		{"op":"null","name":"bat4.Scaling","inputs":[]},
		{"op":"null","name":"bat4.Biases","inputs":[]},
		{"op":"null","name":"bat4.MovingMean","inputs":[]},
		{"op":"null","name":"bat4.MovingVariance","inputs":[]},
		{"op":"BatchNorm","name":"bat4","attrs":{"eps":"0.001","momentum":"0.9","fix_gamma":"false","use_global_stats":"false","axis":"1","cudnn_off":"0"},"inputs":[[30,0,0],[31,0,0],[32,0,0],[33,0,0],[34,0,0]]},
		{"op":"relu","name":"ramp4$0","inputs":[[35,0,0]]},
		{"op":"Pooling","name":"pooling","attrs":{"kernel":"(116, 116)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"valid","pad":"(0, 0)"},"inputs":[[36,0,0]]},
		{"op":"flatten","name":"flatten","attrs":{},"inputs":[[37,0,0]]},
		{"op":"null","name":"linear.Weights","inputs":[]},
		{"op":"null","name":"linear.Biases","inputs":[]},
		{"op":"FullyConnected","name":"linear","attrs":{"num_hidden":"1024","no_bias":"False"},"inputs":[[38,0,0],[39,0,0],[40,0,0]]},
		{"op":"Dropout","name":"drop2$0","attrs":{"p":"0.3","mode":"always","axes":"()"},"inputs":[[41,0,0]]},
		{"op":"null","name":"linear2.Weights","inputs":[]},
		{"op":"null","name":"linear2.Biases","inputs":[]},
		{"op":"FullyConnected","name":"linear2","attrs":{"num_hidden":"4","no_bias":"False"},"inputs":[[42,0,0],[43,0,0],[44,0,0]]},
		{"op":"softmax","name":"softmax$0","attrs":{"axis":"1"},"inputs":[[45,0,0]]},
		{"op":"identity","name":"Output","inputs":[[46,0,0]]}
	],
	"arg_nodes":[0,1,2,4,5,6,7,10,11,13,14,15,16,19,20,22,23,24,25,28,29,31,32,33,34,39,40,43,44],
	"heads":[[47,0,0]],
	"attrs":{
		"mxnet_version":["int",10500]
	}
}